Revit 2027 API
PipeSettings.SetFlowConvertionServerInfo Method
 Set the MEPServerInfo of the current plumbing flow convertion server.
Namespace: Autodesk.Revit.DB.Plumbing
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public void SetFlowConvertionServerInfo(
	MEPCalculationServerInfo serverInfo
)
Public Sub SetFlowConvertionServerInfo (
	serverInfo As MEPCalculationServerInfo
)
public:
void SetFlowConvertionServerInfo(
	MEPCalculationServerInfo^ serverInfo
)
member SetFlowConvertionServerInfo :
        serverInfo : MEPCalculationServerInfo -> unit
Parameters
serverInfo MEPCalculationServerInfo
Exceptions
Exception | Condition
ArgumentNullException |  A non-optional argument was null
See Also
Reference
PipeSettings Class
Autodesk.Revit.DB.Plumbing Namespace